faronov/efr32mg1p-zigbee-sensor/app.c
#if APP_DEBUG_RESET_NETWORK
  app_debug_reset_network_state();
#endif
  emberAfCorePrintln("Zigbee BME280 Sensor Application");
  emberAfCorePrintln("Silicon Labs EFR32MG1P + Bosch BME280");
  emberAfCorePrintln("Press BTN0 to join network or trigger sensor reading");

  // Initialize LED events
  sl_zigbee_event_init(&led_blink_event, led_blink_event_handler);
  sl_zigbee_event_init(&led_off_event, led_off_event_handler);

  // Button handling uses emberAfTickCallback() to check flags - no events needed

  // Initialize optimized rejoin event (TEMPORARILY DISABLED - event queue issue)
  // sl_zigbee_event_init(&rejoin_retry_event, rejoin_retry_event_handler);

  // Initialize configuration from NVM
  app_config_init();
  if (!log_basic_identity()) {
    basic_identity_pending = true;
  }

#if APP_DEBUG_DIAG_ALWAYS
  app_flash_probe();
#endif

  // Initialize BME280 sensor
  if (!app_sensor_init()) {
    emberAfCorePrintln("ERROR: Sensor initialization failed!");
#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
    // Rapid blink on error
    for (int i = 0; i < 10; i++) {
      sl_led_toggle(&sl_led_led0);
      sl_sleeptimer_delay_millisecond(100);
    }
#endif
  }

#if APP_DEBUG_AUTO_JOIN_ON_BOOT
  APP_DEBUG_PRINTF("Debug: auto-join on boot\n");
  handle_short_press();
#endif

#if APP_DEBUG_AUTO_JOIN_ON_PIN_RESET
  // TRADFRI button can be wired to reset line on some hardware revisions.
  // If boot reason is external pin reset, treat it as an implicit join request.
  if (halGetResetInfo() == 0x03u) {
    APP_DEBUG_PRINTF("Debug: auto-join after pin reset\n");
    handle_short_press();
  }
#endif
}

void emberAfMainInitCallback(void)
{
  // In GSDK 4.5 this callback happens early in AF startup sequence.
  // Defer heavy app init until endpoints are configured.
  APP_DEBUG_PRINTF("AF main init callback\n");
}

#if APP_DEBUG_RESET_NETWORK
static void app_debug_reset_network_state(void)
{
  if (debug_reset_network_done) {
    return;
  }
  debug_reset_network_done = true;
  emberAfCorePrintln("Debug: resetting network state");
  EmberStatus leave_status = emberLeaveNetwork();
  emberAfCorePrintln("Debug: leave network -> 0x%02X", leave_status);
  EmberStatus bind_status = emberClearBindingTable();
  emberAfCorePrintln("Debug: clear binding table -> 0x%02X", bind_status);
  EmberStatus key_status = emberClearKeyTable();
  emberAfCorePrintln("Debug: clear key table -> 0x%02X", key_status);
  join_attempt_count = 0;
  current_channel_index = 0;
  join_scan_in_progress = false;
  join_network_found = false;
  network_join_in_progress = false;
}
#endif

void app_debug_force_af_init(void)
{
#if defined(APP_DEBUG_FORCE_AF_INIT) && (APP_DEBUG_FORCE_AF_INIT != 0)
  if (!af_init_seen) {
    APP_DEBUG_PRINTF("AF init requested (debug)\n");
    af_init_force_pending = true;
  }
#endif
}

void app_debug_poll(void)
{
  uint32_t now = sl_sleeptimer_get_tick_count();

  // Initialize once the AF endpoint table is ready.
  if (!af_init_seen && emberAfEndpointCount() > 0) {
    APP_DEBUG_PRINTF("AF init deferred: endpoints ready\n");
    app_init_once();
  }

  if (!af_init_reported && af_init_seen) {
    af_init_reported = true;
    APP_DEBUG_PRINTF("AF init seen (tick)\n");
  }

  if (af_init_force_pending && !af_init_seen) {
    if (af_init_force_tick == 0) {
      af_init_force_tick = now;
    } else if (sl_sleeptimer_tick_to_ms(now - af_init_force_tick) >= 2000) {
      APP_DEBUG_PRINTF("AF init timeout - fallback callback\n");
      app_init_once();
      af_init_force_pending = false;
    }
  }

  // Some debug builds run without AF tick wiring, so process deferred joins here.
  if (join_pending && af_init_seen && !network_join_in_progress) {
    join_pending = false;
    APP_DEBUG_PRINTF("Join: deferred request starting (poll)\n");
    handle_short_press();
  }

  if (basic_identity_pending && af_init_seen) {
    if (basic_identity_tick == 0 ||
        sl_sleeptimer_tick_to_ms(now - basic_identity_tick) >= 2000) {
      basic_identity_tick = now;
      if (log_basic_identity()) {
        basic_identity_pending = false;
      }
    }
  }

#if defined(SL_CATALOG_POWER_MANAGER_PRESENT) && (APP_DEBUG_AWAKE_AFTER_JOIN_MS > 0)
  if (app_join_awake_active && app_join_awake_start_tick != 0) {
    uint32_t elapsed_ms = sl_sleeptimer_tick_to_ms(now - app_join_awake_start_tick);
    if (elapsed_ms >= APP_DEBUG_AWAKE_AFTER_JOIN_MS) {
      sl_power_manager_remove_em_requirement(SL_POWER_MANAGER_EM0);
      app_join_awake_active = false;
      app_join_awake_start_tick = 0;
      APP_DEBUG_PRINTF("Debug: post-join awake window ended\n");
    }
  }
#endif

#if (APP_DEBUG_FAST_POLL_AFTER_JOIN_MS > 0)
  if (app_fast_poll_active && app_fast_poll_start_tick != 0) {
    uint32_t elapsed_ms = sl_sleeptimer_tick_to_ms(now - app_fast_poll_start_tick);
    if (elapsed_ms >= APP_DEBUG_FAST_POLL_AFTER_JOIN_MS) {
      emberAfSetDefaultPollControlCallback(EMBER_AF_LONG_POLL);
      emberAfRemoveFromCurrentAppTasksCallback(EMBER_AF_FORCE_SHORT_POLL_FOR_PARENT_CONNECTIVITY);
      app_fast_poll_active = false;
      app_fast_poll_start_tick = 0;
      APP_DEBUG_PRINTF("Debug: fast poll window ended\n");
    }
  }
#endif
}

bool app_debug_button_ready(void)
{
  return af_init_seen;
}

static bool log_basic_identity(void)
{
  uint8_t buf[1 + 32];
  char str[33];
  EmberAfStatus st;
  uint8_t endpoint_count = emberAfEndpointCount();
  if (endpoint_count == 0) {
    APP_DEBUG_PRINTF("Basic: endpoints not ready (count=0)\n");
    return false;
  }
  uint8_t endpoint = emberAfEndpointFromIndex(0);
  APP_DEBUG_PRINTF("Basic: using endpoint %u (count=%u)\n",
                   endpoint,
                   endpoint_count);

#ifdef ZCL_POWER_SOURCE_ATTRIBUTE_ID
  {
    uint8_t power_source = 0x03; // Battery
    EmberAfStatus wr = emberAfWriteServerAttribute(endpoint,
                                                    ZCL_BASIC_CLUSTER_ID,
                                                    ZCL_POWER_SOURCE_ATTRIBUTE_ID,
                                                    &power_source,
                                                    ZCL_ENUM8_ATTRIBUTE_TYPE);
    APP_DEBUG_PRINTF("Basic: set power source(battery) -> 0x%02x\n", wr);
  }
#endif

