faronov/efr32mg1p-zigbee-sensor/app.c
#if (APP_DEBUG_FAST_POLL_AFTER_JOIN_MS > 0)
    emberAfSetDefaultPollControlCallback(EMBER_AF_SHORT_POLL);
    emberAfAddToCurrentAppTasksCallback(EMBER_AF_FORCE_SHORT_POLL_FOR_PARENT_CONNECTIVITY);
    emberAfSetShortPollIntervalMsCallback(clamp_u16_ms(APP_DEBUG_FAST_POLL_INTERVAL_MS));
    emberAfSetWakeTimeoutMsCallback(clamp_u16_ms(APP_DEBUG_FAST_POLL_AFTER_JOIN_MS));
    app_fast_poll_active = true;
    app_fast_poll_start_tick = sl_sleeptimer_get_tick_count();
    APP_DEBUG_PRINTF("Debug: fast poll enabled for %lu ms (short=%lu ms)\n",
                     (unsigned long)APP_DEBUG_FAST_POLL_AFTER_JOIN_MS,
                     (unsigned long)APP_DEBUG_FAST_POLL_INTERVAL_MS);
#endif

    // Reset join attempt counter and scan state on success
    join_attempt_count = 0;
    current_channel_index = 0;
    network_join_in_progress = false;
    join_scan_in_progress = false;
    join_network_found = false;

    // Cancel any pending rejoin attempts - network is up (TEMPORARILY DISABLED)
    // rejoin_state = REJOIN_STATE_DONE;
    // sl_zigbee_event_set_inactive(&rejoin_retry_event);

    // Stop LED blinking
    led_blink_active = false;
    sl_zigbee_event_set_inactive(&led_blink_event);

#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
    // Turn LED on solid to indicate network is up
    sl_led_turn_on(&sl_led_led0);

    // Schedule LED to turn off after 3 seconds to save power
    sl_zigbee_event_set_delay_ms(&led_off_event, 3000);
#endif

    // Avoid heavy sensor transactions right at join/interview start.
    // Start periodic updates and let first sample happen on timer.
    app_sensor_start_periodic_updates();

    // Note: Binding is handled by coordinator (Zigbee2MQTT/ZHA/deCONZ)
    // No device-side binding code needed - see BINDING_GUIDE.md

  } else if (status == EMBER_NETWORK_DOWN) {
    emberAfCorePrintln("Network down - will attempt optimized rejoin");

#if (APP_DEBUG_FAST_POLL_AFTER_JOIN_MS > 0)
    emberAfSetDefaultPollControlCallback(EMBER_AF_LONG_POLL);
    emberAfRemoveFromCurrentAppTasksCallback(EMBER_AF_FORCE_SHORT_POLL_FOR_PARENT_CONNECTIVITY);
    app_fast_poll_active = false;
    app_fast_poll_start_tick = 0;
#endif

#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
    // Turn LED off when network is down
    sl_led_turn_off(&sl_led_led0);
    // Cancel any pending LED off event
    sl_zigbee_event_set_inactive(&led_off_event);
#endif

    // Sensor timer will automatically stop reading when event handler checks network state
    // Device will use minimal power while waiting for network

    // Optimized rejoin TEMPORARILY DISABLED - event queue issue
    // emberAfCorePrintln("Scheduling optimized rejoin in 100ms...");
    // rejoin_state = REJOIN_STATE_IDLE;
    // sl_zigbee_event_set_delay_ms(&rejoin_retry_event, 100);

  }
}

bool emberAfPreCommandReceivedCallback(EmberAfClusterCommand *cmd)
{
  if (cmd != NULL && cmd->mfgSpecific == 0u) {
    if (cmd->commandId == ZCL_CONFIGURE_REPORTING_COMMAND_ID
        || cmd->commandId == ZCL_READ_REPORTING_CONFIGURATION_COMMAND_ID) {
      APP_DEBUG_PRINTF("ZCL cfg-report rx: ep=%u clus=0x%04x cmd=0x%02x dir=%u len=%u\n",
                       cmd->apsFrame->destinationEndpoint,
                       cmd->apsFrame->clusterId,
                       cmd->commandId,
                       (unsigned)((cmd->buffer[0] & ZCL_FRAME_CONTROL_CLIENT_TO_SERVER) ? 1 : 0),
                       cmd->bufLen);
    }
  }
  return false;
}

/**
 * @brief Button press callback
 *
 * Called when a button is pressed or released on the board.
 * Detects short press (<5s) vs long press (>=5s).
 *
 * CRITICAL: This runs in ISR context (GPIO_ODD_IRQn)!
 * CANNOT call ANY functions that interact with Zigbee stack!
 * CANNOT call emberAfCorePrintln()!
 * CANNOT call sl_zigbee_event_set_active()!
 *
 * Only allowed: read hardware, do math, set volatile flags
 * The button_poll_event running in main context will check these flags
 */
#ifdef SL_CATALOG_SIMPLE_BUTTON_PRESENT
void sl_button_on_change(const sl_button_t *handle)
{
  if (handle == &sl_button_btn0) {
    if (sl_button_get_state(handle) == SL_SIMPLE_BUTTON_PRESSED) {
      // Button pressed - record start time
      button_press_start_tick = sl_sleeptimer_get_tick_count();
      button_pressed = true;
    } else {
      // Button released - check duration
      if (button_pressed) {
        uint32_t duration_ticks = sl_sleeptimer_get_tick_count() - button_press_start_tick;
        uint32_t duration_ms = sl_sleeptimer_tick_to_ms(duration_ticks);

        // Set flags for main context to poll
        // These will be checked by button_poll_event_handler()
        if (duration_ms >= LONG_PRESS_THRESHOLD_MS) {
          button_long_press_pending = true;
        } else {
          button_short_press_pending = true;
        }

        button_pressed = false;
      }
    }
  }
}
#endif

/**
 * @brief LED blink event handler
 *
 * Blinks the LED while joining network.
 */
static void led_blink_event_handler(sl_zigbee_event_t *event)
{
#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
  if (led_blink_active) {
    sl_led_toggle(&sl_led_led0);
    // Blink every 500ms
    sl_zigbee_event_set_delay_ms(&led_blink_event, 500);
  }
#endif
}

/**
 * @brief LED off event handler
 *
 * Turns off the LED after network join confirmation to save power.
 */
static void led_off_event_handler(sl_zigbee_event_t *event)
{
#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
  sl_led_turn_off(&sl_led_led0);
  emberAfCorePrintln("LED turned off to save power");
#endif
}

/**
 * @brief Main tick callback - runs every main loop iteration
 *
 * This is called from main context and is perfect for checking button flags
 * set by the button ISR. No event scheduling needed!
 */
void emberAfMainTickCallback(void)
{
  static uint32_t last_heartbeat_tick = 0;
  uint32_t now = sl_sleeptimer_get_tick_count();

#ifdef SL_CATALOG_SIMPLE_BUTTON_PRESENT
  // Simple button is configured in poll mode on this board; poll here so
  // sl_button_on_change() is invoked reliably.
  sl_simple_button_poll_instances();
#if (APP_DEBUG_POLL_BUTTON == 0)
  // Fallback path: some TRADFRI revisions do not trigger on_change reliably.
  // Poll raw BTN0 (PB13, active low) and synthesize press events with debounce.
  bool raw_pressed = (GPIO_PinInGet(gpioPortB, 13) == 0);
  if (raw_pressed && !btn0_fallback_pressed) {
    btn0_fallback_pressed = true;
    btn0_fallback_press_tick = now;
  } else if (!raw_pressed && btn0_fallback_pressed) {
    btn0_fallback_pressed = false;
    uint32_t duration_ms = sl_sleeptimer_tick_to_ms(now - btn0_fallback_press_tick);
    if (duration_ms >= BUTTON_DEBOUNCE_MS) {
      if (duration_ms >= LONG_PRESS_THRESHOLD_MS) {
        button_long_press_pending = true;
      } else {
        button_short_press_pending = true;
      }
    }
    btn0_fallback_press_tick = 0;
  }
#endif
#endif

