faronov/efr32mg1p-zigbee-sensor/app.c
    EmberNodeType node_type = APP_DEBUG_JOIN_AS_END_DEVICE ? EMBER_END_DEVICE : EMBER_SLEEPY_END_DEVICE;
    APP_DEBUG_PRINTF("Join: node type=%s\n",
                     APP_DEBUG_JOIN_AS_END_DEVICE ? "END_DEVICE" : "SLEEPY_END_DEVICE");
    EmberStatus join_status = emberJoinNetwork(node_type, &params);
    APP_DEBUG_PRINTF("Join: emberJoinNetwork -> 0x%02x\n", join_status);
    if (join_status != EMBER_SUCCESS) {
      emberAfCorePrintln("Join failed to start: 0x%x", join_status);
      join_network_found = false;
      try_next_channel();
    }
    return;
  }

  // No joinable network on this channel - try next channel
  try_next_channel();
}

/**
 * @brief Handle short button press (<5 seconds)
 *
 * Short press triggers immediate sensor read and report.
 * If not joined to network, starts network joining.
 */
static void handle_short_press(void)
{
#if APP_DEBUG_SPI_ONLY
  app_flash_probe();
  return;
#endif
  EmberNetworkStatus network_state = emberAfNetworkState();

  if (network_state == EMBER_JOINED_NETWORK) {
    // Already on network - trigger immediate sensor reading
    emberAfCorePrintln("Triggering immediate sensor read...");
    app_sensor_update();

#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
    // Flash LED briefly to indicate sensor read
    sl_led_turn_on(&sl_led_led0);
    sl_sleeptimer_delay_millisecond(200);
    sl_led_turn_off(&sl_led_led0);
#endif

  } else {
    if (!af_init_seen) {
      APP_DEBUG_PRINTF("Join: AF init not ready - deferring\n");
      join_pending = true;
      return;
    }
    if (network_join_in_progress) {
      emberAfCorePrintln("Join already in progress - ignoring button press");
      APP_DEBUG_PRINTF("Join: already in progress\n");
      return;
    }

    // Not on network - start join flow
    emberAfCorePrintln("Not joined - starting network join (attempt %d)...",
                       join_attempt_count + 1);
    APP_DEBUG_PRINTF("Join: attempt %d\n", join_attempt_count + 1);

#if (APP_DEBUG_FAST_POLL_AFTER_JOIN_MS > 0)
    // Keep Sleepy End Device in short poll mode across join + interview window.
    // This matches SDK guidance for reliable TC key update/interview traffic.
    emberAfSetDefaultPollControlCallback(EMBER_AF_SHORT_POLL);
    emberAfAddToCurrentAppTasksCallback(EMBER_AF_FORCE_SHORT_POLL_FOR_PARENT_CONNECTIVITY);
    emberAfSetShortPollIntervalMsCallback(clamp_u16_ms(APP_DEBUG_FAST_POLL_INTERVAL_MS));
    emberAfSetWakeTimeoutMsCallback(clamp_u16_ms(APP_DEBUG_FAST_POLL_AFTER_JOIN_MS));
    app_fast_poll_active = true;
    app_fast_poll_start_tick = sl_sleeptimer_get_tick_count();
    APP_DEBUG_PRINTF("Join: pre-join fast poll enabled (%lu ms, short=%lu ms)\n",
                     (unsigned long)APP_DEBUG_FAST_POLL_AFTER_JOIN_MS,
                     (unsigned long)APP_DEBUG_FAST_POLL_INTERVAL_MS);
#endif

    // Reset to start of channel list
    current_channel_index = 0;
    join_scan_in_progress = false;
    join_network_found = false;
    network_join_in_progress = true;

#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
    // Start LED blinking to indicate joining
    led_blink_active = true;
    sl_zigbee_event_set_active(&led_blink_event);
#endif

#ifdef SL_CATALOG_ZIGBEE_NETWORK_STEERING_PRESENT
    EmberStatus join_status = emberAfPluginNetworkSteeringStart();
    APP_DEBUG_PRINTF("Join: emberAfPluginNetworkSteeringStart -> 0x%02x\n", join_status);
#else
    configure_join_security();
    EmberStatus join_status = start_join_scan();
#endif

    if (join_status != EMBER_SUCCESS) {
      emberAfCorePrintln("Join failed to start: 0x%x", join_status);
      if (join_status == EMBER_INVALID_CALL) {
        emberAfCorePrintln("Join aborted: stack not ready");
        network_join_in_progress = false;
        join_scan_in_progress = false;
        join_network_found = false;
      } else {
#ifdef SL_CATALOG_ZIGBEE_NETWORK_STEERING_PRESENT
        network_join_in_progress = false;
        join_scan_in_progress = false;
        join_network_found = false;
#else
        try_next_channel();
#endif
      }

#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
      // Stop LED blinking on failure
      if (!network_join_in_progress) {
        led_blink_active = false;
        sl_zigbee_event_set_inactive(&led_blink_event);
        sl_led_turn_off(&sl_led_led0);
      }
#endif
    }
  }
}

#ifdef SL_CATALOG_ZIGBEE_NETWORK_STEERING_PRESENT
void emberAfPluginNetworkSteeringCompleteCallback(EmberStatus status,
                                                  uint8_t totalBeacons,
                                                  uint8_t joinAttempts,
                                                  uint8_t finalState)
{
  APP_DEBUG_PRINTF("Join: steering complete status=0x%02x beacons=%u attempts=%u state=%u\n",
                   status, totalBeacons, joinAttempts, finalState);
  if (status != EMBER_SUCCESS) {
    network_join_in_progress = false;
    join_scan_in_progress = false;
    join_network_found = false;
    join_attempt_count++;
#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
    led_blink_active = false;
    sl_zigbee_event_set_inactive(&led_blink_event);
    sl_led_turn_off(&sl_led_led0);
#endif
  }
}
#endif

static void configure_join_security(void)
{
  if (join_security_configured) {
    return;
  }

  EmberInitialSecurityState state;
  memset(&state, 0, sizeof(state));
  memcpy(state.preconfiguredKey.contents, zigbee_alliance_key, EMBER_ENCRYPTION_KEY_SIZE);
  state.bitmask = (EMBER_HAVE_PRECONFIGURED_KEY
                   | EMBER_REQUIRE_ENCRYPTED_KEY
                   | EMBER_TRUST_CENTER_GLOBAL_LINK_KEY);

  EmberStatus st = emberSetInitialSecurityState(&state);
  APP_DEBUG_PRINTF("Join: set security state -> 0x%02x\n", st);
  if (st == EMBER_SUCCESS) {
    join_security_configured = true;
  }
}

/**
 * @brief Handle long button press (>=5 seconds)
 *
 * Long press toggles network state:
 * - joined: leave network
 * - not joined: start join
 */
static void handle_long_press(void)
{
  EmberNetworkStatus network_state = emberAfNetworkState();

  if (network_state == EMBER_JOINED_NETWORK) {
    emberAfCorePrintln("Long press: leaving network...");

    // Leave the network
    EmberStatus leave_status = emberLeaveNetwork();
    if (leave_status == EMBER_SUCCESS) {
      emberAfCorePrintln("Leave requested, waiting for network down");
    } else {
      emberAfCorePrintln("Failed to leave network: 0x%x", leave_status);
    }
  } else {
    emberAfCorePrintln("Long press: not joined, starting join");
    handle_short_press();
  }
}
